Revit 2026 API

# GenericColorByObject Property

---

The property labeled "Color By Object" from the "Generic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string ColorByObject { get; }
```
```vb
Public Shared ReadOnly Property ColorByObject As String
	Get
```
```cpp
public:
static property String^ ColorByObject {
	String^ get ();
}
```
```fsharp
static member ColorByObject : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

Generic Class

Autodesk.Revit.DB.Visual Namespace